/*
За проверка на това дали сте разбрали сортирането с броене напишете програма, която едновременно сортира и премахва дубликати от масив.
Ако има числа които се срещат няколко пъти във входният масив, то изходният масив ще е с по-малко елементи,
като ще съдържа всички уникални числа с наредена последователност

Input Format
Вход: N - големина на масив за сортиране
x1 x2 …. xN - елементите на масива

Constraints
Ограничения
1 < N < 1 000 000
0 < xi < 10 000

Output Format

Изход: Сортирани числа без повторение

Sample Input

6
4 5 4 6 5 7
Sample Output

4 5 6 7
 */
#include <iostream>

int main()
{
    int N;
    std::cin >> N;
    int count = 10001;

    int arr[1000000];
    int counts[10001];

    for (int i = 0; i < count; i++)
    {
        counts[i] = 0;
    }

    for (int i = 0; i < N; i++)
    {
        std::cin >> arr[i];
        counts[arr[i]] = counts[arr[i]] + 1;
    }

    for (int i = 0; i <= count - 1; i++)
    {
        if (counts[i] != 0)
        {
            std::cout << i << " ";
        }
    }

    return 0;
}
